Catalogs/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаСканированияКодаМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/УдалитьНастройкиУчетаМаркируемойПродукцииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УдалитьНастройкиУчетаМаркируемойПродукцииИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонтрольПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонтрольВыводИзОборота</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРозницаУведомительныйРежим</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРозницаРазрешительныйРежим</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРозницаЛокальныйРазрешительныйРежим</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОптКонтрольПоштучно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОптКонтрольОСУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапретПродажиНемаркированныхОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрослеживаемостьПеремещенияМеждуМОД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонтроляРазрешительныхДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПоставляемыеДанныеКлассификаторовВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоставляемыеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмеютсяНезагруженныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Виды продукции по идентификаторам.
// 
// Параметры:
//  ИдентификаторыВидовПродукции - Массив из Строка - идентификаторы видов продукции
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - идентификатор вида продукции
//   * Значение - СправочникСсылка.ВидыПродукцииИС - вид продукции
Функция ВидыПродукцииПоИдентификаторам(ИдентификаторыВидовПродукции) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие;
	
	Если ИдентификаторыВидовПродукции.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыПродукцииИС.Ссылка                     КАК ВидПродукции,
		|	ВидыПродукцииИС.Идентификатор              КАК Идентификатор,
		|	ВидыПродукцииИС.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ИЗ
		|	Справочник.ВидыПродукцииИС КАК ВидыПродукцииИС
		|ГДЕ
		|	ВидыПродукцииИС.Идентификатор В (&Идентификаторы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ХешСуммаПоставляемыхДанных";
	
	Запрос.УстановитьПараметр("Идентификаторы", ИдентификаторыВидовПродукции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВозвращаемоеЗначение.Вставить(ВыборкаДетальныеЗаписи.Идентификатор, ВыборкаДетальныеЗаписи.ВидПродукции);
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Обработка данных перехода на конструктор настроек видов продукции
// 
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	НачатьТранзакцию();
	
	ЗагрузитьПринудительно = Ложь;
	
	Если Не ОбщегоНазначенияИС.ВедетсяУчетПродукцииИС()
		И Не ОбщегоНазначения.РазделениеВключено() Тогда
		ЗагрузитьПринудительно = ОбновлениеИнформационнойБазыГосИС.ЕстьУчетныеДанныеДляПереходаНаКонструктор();
	КонецЕсли;
	
	Попытка
		
		РезультатОбновления = ОбщегоНазначенияИС.ПервоначальноеЗаполнениеКлассификаторовВидовПродукции(ЗагрузитьПринудительно);
		Если Не РезультатОбновления.УспешнаяЗагрузка Тогда
			ВызватьИсключение РезультатОбновления.СообщениеОбОшибке;
		КонецЕсли;
		
		Если Не ОбновлениеИнформационнойБазыГосИС.ЭтоРежимСервиса()
			И ОбщегоНазначенияИС.ПодсистемаСуществует("ИСМП") Тогда
			
			МенеджерРегистра = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("РегистрСведений.УдалитьНастройкиУчетаМаркируемойПродукцииИСМП");
			МенеджерРегистра.ОбработатьДанныеДляПереходаНаНовуюВерсию();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось загрузить классификаторы настроек видов продукции механизма конструктора видов продукции по причине:
				       |%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстСообщения);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецПопытки;
	
КонецПроцедуры

// Выполняет повторную загрузку классификатора в случае,
// если в ранее загруженном классификаторе встретились отсутствующие элементы (метаданные, предопределенные значения)
Процедура ОбработатьДанныеПриПовторнойЗагрузкеКлассификатора() Экспорт
	
	ИдентификаторыКлассификаторов = ОбщегоНазначенияИС.ИдентификаторыКлассификаторов();
	ИдентификаторВидовПродукции   = ОбщегоНазначенияИС.ИдентификаторКлассификатораВидовПродукцииИС();
	
	Для Каждого ИдентификаторКлассификатора Из ИдентификаторыКлассификаторов Цикл
		Если ИдентификаторКлассификатора.Ключ = ИдентификаторВидовПродукции Тогда
			Идентификатор = ИдентификаторКлассификатора.Ключ;
			Наименование  = ИдентификаторКлассификатора.Значение.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	ИмеютсяЧастичноЗагруженныеДанные = РегистрыСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ИмеютсяСохраненныеДанныеКлассификатораВидовПродукцииИС(
		Идентификатор, Истина);
	
	Если Не ИмеютсяЧастичноЗагруженныеДанные Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьПринудительно = Ложь;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ЗагрузитьПринудительно = Истина;
	ИначеЕсли Не ОбщегоНазначенияИС.ВедетсяУчетПродукцииИС() Тогда
		ЗагрузитьПринудительно = ОбновлениеИнформационнойБазыГосИС.ЕстьУчетныеДанныеДляПереходаНаКонструктор();
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		РезультатОбновления = ОбщегоНазначенияИС.ПервоначальноеЗаполнениеКлассификаторовВидовПродукции(ЗагрузитьПринудительно);
		Если Не РезультатОбновления.УспешнаяЗагрузка Тогда
			ВызватьИсключение РезультатОбновления.СообщениеОбОшибке;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось загрузить классификаторы %1 по причине:
				       |%2'"),
			Наименование, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстСообщения);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецПопытки;
	
КонецПроцедуры

// Возвращает реквизиты справочника, которые образуют естественный ключ
// для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("Идентификатор");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоПодсистеме") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтрокаПоиска", "%"+Параметры.СтрокаПоиска+"%");
		Запрос.Текст =
		ТекстЗапросаВидовПродукцииСОтборомПоПодсистеме(Параметры.ОтборПоПодсистеме, 50) + "
		|ГДЕ
		|	ВидыПродукции.Наименование ПОДОБНО &СтрокаПоиска";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Выборка.Ссылка;
			Элемент.Представление = Выборка.Наименование;
			Элемент.Пометка = Выборка.ПометкаУдаления;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСОтборомПоПодсистеме(Подсистема, ИмяВременнойТаблицы = "") Экспорт
	
	Если ИмяВременнойТаблицы = "" Тогда
		ТекстПоместить = "";
	Иначе
		ТекстПоместить = СтрШаблон("ПОМЕСТИТЬ %1", ИмяВременнойТаблицы);
	КонецЕсли;
	
	Возврат СтрШаблон(
	"	ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции
	|	%2
	|	ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|	ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукции%1)
	|		И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|	ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|	ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукции%1)
	|		И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления",
	Подсистема,
	ТекстПоместить);
	
КонецФункции

Функция ТекстЗапросаВидовПродукцииСОтборомПоПодсистеме(Подсистема, Первые = 0, ИмяВременнойТаблицы = "") Экспорт
	
	Если Первые > 0 Тогда
		ОтборПервые = СтрШаблон("ПЕРВЫЕ %1", Формат(Первые, "ЧРГ=; ЧГ=;"));
	Иначе
		ОтборПервые = "";
	КонецЕсли;
	
	Если ИмяВременнойТаблицы = "" Тогда
		ТекстПоместить = "";
	Иначе
		ТекстПоместить = СтрШаблон("ПОМЕСТИТЬ %1", ИмяВременнойТаблицы);
	КонецЕсли;
	
	Возврат СтрШаблон(
	"ВЫБРАТЬ %1 ВидыПродукции.*
	|%3
	|ИЗ Справочник.ВидыПродукцииИС КАК ВидыПродукции
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		(%2) КАК ЗначенияЭлементовКонструктора
	|	ПО ВидыПродукции.Ссылка = ЗначенияЭлементовКонструктора.ВидПродукции",
	ОтборПервые,
	ТекстЗапросаСОтборомПоПодсистеме(Подсистема),
	ТекстПоместить);
	
КонецФункции

Функция ТекстЗапросаВидовПродукцииСОтборомПоЭлементуКонструктора(
	ИмяПараметра = "ЭлементКонструктораДляОпределенияДоступныхВидовПродукции",
	Подсистема = Неопределено,
	ИмяВременнойТаблицы = "",
	ВозвращатьТолькоСсылку = Истина) Экспорт
	
	Если Подсистема <> Неопределено Тогда
		ОтборПоПодсистеме = СтрШаблон(
		"	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		(%1) КАК ЗначенияДоступныеВидыПродукции
		|	ПО ВидыПродукции.Ссылка = ЗначенияДоступныеВидыПродукции.ВидПродукции",
		ТекстЗапросаСОтборомПоПодсистеме(Подсистема));
	Иначе
		ОтборПоПодсистеме = "";
	КонецЕсли;
	
	Если ИмяВременнойТаблицы = "" Тогда
		ТекстПоместить = "";
	Иначе
		ТекстПоместить = СтрШаблон("ПОМЕСТИТЬ %1", ИмяВременнойТаблицы);
	КонецЕсли;
	
	Если ВозвращатьТолькоСсылку Тогда
		ПоляВыборки = "ВидыПродукции.Ссылка";
	Иначе
		ПоляВыборки = "ВидыПродукции.*";
	КонецЕсли;
	
	Возврат СтрШаблон(
	"ВЫБРАТЬ %1
	|ИЗ Справочник.ВидыПродукцииИС КАК ВидыПродукции
	|%2
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции
	|		ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|			ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|			И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора В (&%3)
	|			И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|		ОБЪЕДИНИТЬ
	|		ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора В (&%3)
	|			И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
	|		) КАК ЗначенияЭлементовКонструктора
	|	ПО ВидыПродукции.Ссылка = ЗначенияЭлементовКонструктора.ВидПродукции
	|	%4",
	ПоляВыборки,
	ТекстПоместить,
	ИмяПараметра,
	ОтборПоПодсистеме);
	
КонецФункции

Функция ТекстЗапросаВыключенныхВидовПродукцииСОтборомПоЭлементуКонструктора(
	ИмяПараметра,
	Подсистема,
	ИмяВременнойТаблицы = "",
	ВозвращатьТолькоСсылку = Истина) Экспорт
	
	Возврат СтрШаблон(
	"%1
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(%2) КАК ЗначенияДоступныеВидыПродукции
	|ПО ВидыПродукции.Ссылка = ЗначенияДоступныеВидыПродукции.ВидПродукции
	|ГДЕ ЗначенияДоступныеВидыПродукции.ВидПродукции ЕСТЬ NULL",
	ТекстЗапросаВидовПродукцииСОтборомПоЭлементуКонструктора(
		ИмяПараметра,
		Неопределено,
		ИмяВременнойТаблицы,
		ВозвращатьТолькоСсылку),
	ТекстЗапросаСОтборомПоПодсистеме(Подсистема));
	
КонецФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.Справочники.ВидыПродукцииИС.ПолноеИмя());
	
	Попытка	
		Блокировка.Заблокировать();
		ОбновитьВидыПродукцииИСИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьВидыПродукцииИСИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки)
	
	Идентификаторы         = ПараметрыЗагрузки.Идентификаторы;
	ДанныеПоВидамПродукции = ДанныеКлассификатора.ВидыПродукцииИС;
	ИмяТаблицы             = Метаданные.Справочники.ВидыПродукцииИС.ПолноеИмя();
	КонфликтыОбновления    = ПараметрыЗагрузки.КонфликтыОбновления;
	
	ДанныеДляПодбора = Новый ТаблицаЗначений;
	ДанныеДляПодбора.Колонки.Добавить("Наименование",  ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ДанныеДляПодбора.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	Для каждого СтрокаКЗагрузке из ДанныеПоВидамПродукции Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляПодбора.Добавить(), СтрокаКЗагрузке);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Наименование КАК Наименование,
		|	ДанныеДляПодбора.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втДанныеДляПодбора
		|ИЗ
		|	&ДанныеДляПодбора КАК ДанныеДляПодбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ВидыПродукцииИС.Ссылка КАК СсылкаПоИдентификатору,
		|	ВидыПродукцииИС.ХешСумма КАК ХешСумма,
		|	ВидыПродукцииИС.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоИдентификатору
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыПродукцииИС КАК ВидыПродукцииИС
		|		ПО (ВидыПродукцииИС.Идентификатор = втДанныеДляПодбора.Идентификатор)
		|ГДЕ
		|	втДанныеДляПодбора.Идентификатор <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыПродукцииИС.Ссылка КАК СсылкаПоКлючевымПолям,
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ВидыПродукцииИС.ХешСумма КАК ХешСумма,
		|	ВидыПродукцииИС.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоКлючевымПолям
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыПродукцииИС КАК ВидыПродукцииИС
		|		ПО втДанныеДляПодбора.Наименование = ВидыПродукцииИС.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатыПодбораПоКлючевымПолям.Наименование КАК Наименование,
		|	втРезультатыПодбораПоКлючевымПолям.Идентификатор КАК Идентификатор,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(втРезультатыПодбораПоКлючевымПолям.СсылкаПоКлючевымПолям, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору
		|	КОНЕЦ КАК СуществующийОбъектСсылка,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСумма
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСумма
		|	КОНЕЦ КАК ХешСумма,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСуммаПоставляемыхДанных
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСуммаПоставляемыхДанных
		|	КОНЕЦ КАК ХешСуммаПоставляемыхДанных
		|ИЗ
		|	втРезультатыПодбораПоКлючевымПолям КАК втРезультатыПодбораПоКлючевымПолям
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатыПодбораПоИдентификатору КАК втРезультатыПодбораПоИдентификатору
		|		ПО втРезультатыПодбораПоКлючевымПолям.Идентификатор = втРезультатыПодбораПоИдентификатору.Идентификатор
		|		И втРезультатыПодбораПоКлючевымПолям.Наименование = втРезультатыПодбораПоИдентификатору.Наименование";
	Запрос.УстановитьПараметр("ДанныеДляПодбора", ДанныеДляПодбора);
	ПодобранныеДанные = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ЭлементКЗагрузке Из ДанныеПоВидамПродукции Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Наименование",  ЭлементКЗагрузке.Наименование);
		СтруктураПоиска.Вставить("Идентификатор", ЭлементКЗагрузке.Идентификатор);

		НайденныеСтроки = ПодобранныеДанные.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			СтрокаПодобранныхДанных = НайденныеСтроки[0];
		Иначе
			Продолжить;
		КонецЕсли;

		СтрокаИдентификатора = Идентификаторы.Добавить();
		СтрокаИдентификатора.ИмяТаблицы    = ИмяТаблицы;
		СтрокаИдентификатора.Идентификатор = ЭлементКЗагрузке.Идентификатор;
		СтрокаИдентификатора.Наименование  = ЭлементКЗагрузке.Наименование;
		
		Если ПараметрыЗагрузки.ЗагрузкаИзменений И ЭлементКЗагрузке.Свойство("Модифицирован") Тогда
			Если Не ЭлементКЗагрузке.Модифицирован Тогда
				СтрокаИдентификатора.Ссылка = СтрокаПодобранныхДанных.СуществующийОбъектСсылка;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ДальнейшиеДействия = ОбщегоНазначенияИС.ПараметрыОбновленияЭлементовПриЗагрузкеКлассификатора(ПараметрыЗагрузки,
			СтрокаПодобранныхДанных.СуществующийОбъектСсылка, СтрокаПодобранныхДанных.ХешСумма,
			СтрокаПодобранныхДанных.ХешСуммаПоставляемыхДанных, ЭлементКЗагрузке.ХешСуммаПоставляемыхДанных);
		
		Если ДальнейшиеДействия.КоллизияИзменений Тогда
			ТекстКоллизии = СтрШаблон(НСтр(
				"ru = 'Невозможно загрузить изменения. Элемент справочника ""%1"" с идентификатором ""%2"" был изменен ранее'"),
				ИмяТаблицы, ЭлементКЗагрузке.Идентификатор);
			ВызватьИсключение ТекстКоллизии;
		КонецЕсли;
		
		Если ДальнейшиеДействия.СоздатьЭлемент Тогда
			СуществующийОбъект = СоздатьЭлемент();
		ИначеЕсли ДальнейшиеДействия.ТребуетсяОбновление Тогда
			СуществующийОбъект = СтрокаПодобранныхДанных.СуществующийОбъектСсылка.ПолучитьОбъект();
		Иначе
			СтрокаИдентификатора.Ссылка = СтрокаПодобранныхДанных.СуществующийОбъектСсылка;		
		КонецЕсли;
		
		Если ДальнейшиеДействия.ЗафиксироватьКонфликт Тогда
			ОбщегоНазначенияИС.ДобавитьЭлементДляЗаписиКонфликтаПриОбновлении(
				КонфликтыОбновления, СтрокаПодобранныхДанных.СуществующийОбъектСсылка, ЭлементКЗагрузке);
		КонецЕсли;	

		Если ДальнейшиеДействия.ТребуетсяОбновление Или ДальнейшиеДействия.СоздатьЭлемент Тогда
			ЗаполнитьЗначенияСвойств(СуществующийОбъект, ЭлементКЗагрузке, , "Идентификатор,ХешСуммаПоставляемыхДанных");
            
			Если Не ЗначениеЗаполнено(СуществующийОбъект.Идентификатор) Тогда
				СуществующийОбъект.Идентификатор = ЭлементКЗагрузке.Идентификатор;
			КонецЕсли;

            Если Метаданные.Перечисления.СтатусыКлассификаторовВидовПродукцииИС.ЗначенияПеречисления.Найти(
				ЭлементКЗагрузке.Статус) <> Неопределено Тогда
				СуществующийОбъект.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС[ЭлементКЗагрузке.Статус];
            КонецЕсли;
			
			СуществующийОбъект.ХешСумма = ЭлементКЗагрузке.ХешСуммаПоставляемыхДанных;
			
			Если Не ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
				СуществующийОбъект.ХешСуммаПоставляемыхДанных = ЭлементКЗагрузке.ХешСуммаПоставляемыхДанных;	
			КонецЕсли;
			
			СуществующийОбъект.КартинкаСканированияКодаМаркировки = Новый ХранилищеЗначения(Base64Значение(
				ЭлементКЗагрузке.КартинкаСканированияКодаМаркировки));
            
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СуществующийОбъект);

			СтрокаИдентификатора.Ссылка = СуществующийОбъект.Ссылка;
		
		КонецЕсли;

	КонецЦикла;
	
	Если ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
		ИдентификаторыПоТипу = Идентификаторы.Скопировать(Новый Структура("ИмяТаблицы", ИмяТаблицы), "Наименование,Идентификатор");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИдентификаторов.Наименование КАК Наименование,
		|	ТаблицаИдентификаторов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВтИдентификаторы
		|ИЗ
		|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыПродукцииИС.Ссылка КАК Ссылка,
		|	ВидыПродукцииИС.Идентификатор КАК Идентификатор,
		|	ВидыПродукцииИС.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВидыПродукцииИС КАК ВидыПродукцииИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИдентификаторы КАК ВтИдентификаторы
		|		ПО ВидыПродукцииИС.Идентификатор = ВтИдентификаторы.Идентификатор
		|			И ВидыПродукцииИС.Наименование = ВтИдентификаторы.Наименование
		|ГДЕ
		|	ВтИдентификаторы.Наименование ЕСТЬ NULL
		|	И ВтИдентификаторы.Идентификатор ЕСТЬ NULL";
		Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ИдентификаторыПоТипу);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаИдентификатора = Идентификаторы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИдентификатора, ВыборкаДетальныеЗаписи);
			
			СтрокаИдентификатора.ИмяТаблицы = ИмяТаблицы;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьПараметрыОбновления() Экспорт

    СтруктураДанныхОбновления = Новый Структура;

	СтруктураДанныхОбновления.Вставить("Наименование",                       "");
	СтруктураДанныхОбновления.Вставить("Идентификатор",                      "");
	СтруктураДанныхОбновления.Вставить("КартинкаСканированияКодаМаркировки", "");
	СтруктураДанныхОбновления.Вставить("Статус",                             "");
	СтруктураДанныхОбновления.Вставить("ХешСуммаПоставляемыхДанных",         "");

	Возврат СтруктураДанныхОбновления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
